Revit 2027 API
DrawContext.GetCamera Method
 Gets the camera corresponding to the Revit view where rendering takes place.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Camera GetCamera()
Public Shared Function GetCamera As Camera
public:
static Camera^ GetCamera()
static member GetCamera : unit -> Camera
Return Value
Camera
 The camera.
Exceptions
Exception | Condition
InvalidOperationException |  This DrawContext is not available because Revit is not currently rendering. In general, this DrawContext must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
See Also
Reference
DrawContext Class
Autodesk.Revit.DB.DirectContext3D Namespace